# Кадмият е тежък метал, който може да се натрупа до високи нива в гъбите.
# Измерена е концентрацията на кадмий в случайна извадка от 10 горски гъби събрани в
# дадена местност. Резултатите са следните (в мг/кг):
#           3.1 3.0 3.7 2.6 4.2 3.8 3.6 2.7 3.8 4.4
# Може да предположим, че концентрацията на кадмий е нормално разпределена. Имаме ли
# основание да твърдим, че средната концентрация на кадмий в горските гъбите в дадената
# местност е по-малко от 4 мг/кг?


x<-c(3.1,3.0,3.7,2.6,4.2,3.8,3.6,2.7,3.8,4.4)
n<-length(x)
mu<-4
sigma<-sd(x)

#h0: mu=4
#h1: mu<4

#t-test for average

obs<-(mean(x)-mu)/(sigma/sqrt(n))
obs
pval<-pt(obs,n-1)
pval

#pval=0.0137 <0.05 =>  h1
