# Измерена е дължината на дясното ухо на 66 случайно избрани жени на възраст
# между 18 и 30 години. Резултатите показват средна дължина 61.9 мм и стандартно
# отклонение 4 мм. Нека предположим, че популационната дисперсия е известна и sigma^2 = (4.1)^2.
# Имамелиоснование да твърдим, че средната дължина на дясното ухо на жените на възраст
# между 18 и 30 години е различна от 60 мм?


n<-66
mid<-61.9
sigma<-4.1
mu<-60

#h0: mu=60
#h1: mu!=60

#z-test for average

obs<-(mid-mu)/(sigma/sqrt(n))
obs
pval<-2*(1-pnorm(abs(obs)))
pval

#pval=0.000167 < 0.05 => h1
