# Измерено е нивото на хемоглобин на 10 деца страдащи от специфична болест.
# Данните са:
#      12.3 11.2 14.2 15.3 14.8 13.5 11.1 15.1 15.4 13.2
# Считаме, че нивото на хемоглобин има нормално разпределение.


x<-c(12.3, 11.2, 14.2, 15.3 ,14.8, 13.5, 11.1 ,15.1, 15.4, 13.2)
n<-length(x)
sigma<-sd(x)
sredo<-mean(x)
mu<-14.6

# а) Имаме ли основание да твърдим, че средното ниво на хемоглобин при децата стра
дащи от тази болест е различно от нормалното ниво от 14.6?

#h0: mu=14.6
#h1: mu!=14.6

#t-test for average

obs<-(mean(x)-mu)/(sigma/sqrt(n))
obs
pval<- 2*(1-pt(abs(obs), n-1))
pval
#pval=0.088>0.05=> h0


#  б) Имаме ли основание да твърдим, че средното ниво на хемоглобин при децата стра
дащи от тази болест е по-малко от 14.6?

#h0: mu=14.6
#h1: mu<14.6

#t-test for average

pval<- pt(obs, n-1)
pval
#pval=0.04<0.05 => h1
