# Машина произвежда топки за тенис. Твърди се, че диаметърът на топка,
# произведена от машината, има нормално разпределение със средно mu= 6.7 см и стандартно
# отклонение sigma= 0.12 см. Измерен е диаметърът на 45 случайно избрани топки, произведени
# от машината. Означаваме средния диаметър на избраните топки с Avg. За да решим дали
# mu =6.7, използваме следното правило:
# Ако |Avg −6.7|<0.036, се приема, че mu = 6.7.
# Ако |Avg −6.7|≥0.036, се приема, че mu != 6.7.
# а) Ако mu=6.7, каква е вероятността да се приеме, че mu!= 6.7?
# б) Ако mu=6.75, каква е вероятността да се приеме, че mu!= 6.7?
# в) Ако mu=6.8, каква е вероятността да се приеме, че mu!= 6.7?
# г) Променете правилото, така че вероятността от а) да е 0.05.

mu<-6.7
sigma<-0.12
n<-45

res<-replicate(10000,mean(rnorm(n,mu,sigma)))

sum(res<=6.7-0.036 | res>=6.7+0.036)/length(res)
