# За определяне на съдържанието на примеси в сплави на стомана съществуват
# два метода. В 8 проби е определено съдържанието на примеси по всеки от двата метода.
# Данните са следните:
# Проба Метод1 Метод2
#   1    1.2     1.4
#   2    1.3     1.7
#   3    1.5     1.5
#   4    1.4     1.3
#   5    1.7     2.0
#   6    1.8     2.1
#   7    1.4     1.7
#   8    1.3     1.6
# Считаме, че данните са от нормално разпределение. Може ли да се приеме, че двата метода
# дават в средно едни и същи резултати?

n<-8
first<-c(1.2,1.3,1.5,1.4,1.7,1.8,1.4,1.3)
second<-c(1.4,1.7,1.5,1.3,2,2.1,1.7,1.6)

#h0:muf=mus
#h1:muf!=mus

d<-first - second
n<-length(d)
obs<-mean(d)/(sd(d)/sqrt(n))
pval<- 2*(1-pt(abs(obs), n-1))
pval
#t.test(first,second,paired=T)

#pval = 0.010 < 0.05 => h1
