# За да се сравни скоростта на четене при различни шрифтове, на две групи от
# по 50 човека е даден един и същи текст, но на първата бил написан с един шрифт, а на вто
# рата с друг. Регистрирано е времето, за което всеки участник е прочел текста. Резултатите
# са: за първата група– средно 7.88 минути и стандартно отклонение 1.73; за втората група– средно 8.48 и стандартно отклонение 2.12. Може ли да се твърди, че средното време за
# четене е различно за двата шрифта?

#independent

n<-50
x1<-7.88
sigma1<-1.73
x2<-8.48
sigma2<-2.12

#h0:mu1=mu2
#h1:mu1!=mu2

obs<-(x1-x2)/(sqrt(sigma1^2/n+sigma2^2/n))
df<-(sigma1^2/n+sigma2^2/n)^2/(((sigma1^2/n)^2)/(n-1)+((sigma2^2/n)^2)/(n-1))
pval<-2*(1-pt(abs(obs), df))
pval

#pval = 0.123 > 0.05 => h0

