# На всеки от върховете на равностранен триъгълник има една мравка. Всяка
# мравка избира произволно един от другите два върха и тръгва към него. За единица време
# всяка мравка изминава разстоянието от един връх до друг. Две мравкимогатдасеразминат
# ако тръгнат една срещу друга. Каква е вероятността след единица време да има по една
# мравка на всеки връх?

sim.ants <- function() {
  a1 <- sample( c(2,3), 1 )
  a2 <- sample( c(1,3), 1 )
  a3 <- sample( c(1,2), 1 ) 
  a <- c(a1,a2,a3)
  length( unique(a) ) == 3
  # any( duplicated(a) ) == F
  # all( c(1,2,3) %in% a )
}

prob.ants <- function(Nrep) {
  res <- replicate( Nrep, sim.ants() )
  sum(res)/length(res)
}

prob.ants(100000)
