# Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически
# места. Вероятността пътник да дойде навреме за полета си е 0.92. Нека приемем, че даден
# пътник идва навреме независимо от останалите пътниците.

f10<-function()
{
  arrive<-sample(c(0,1),143,replace=T,prob=c(0.08,0.92))
  sum(arrive)
}

res <- replicate(10000,f10() )

#  а) Каква е вероятността да има място за всички пътници, които са дошли навреме?
sum(res<=138)/length(res)

#  б) Каква е вероятността да остане едно незаето пътническо място?
sum(res==137)/length(res)
