# Проведен е експеримент, при който 58 домашни гълъба са пуснати на свобода
# от непознато място, което е на разстояние 106 км от дома им. От тях 32 намерили пътя към
# дома си. Намерете 95-процентен доверителен интервал за вероятността гълъб от дадения
# вид да намери пътя към дома си от непознато място на 106 км.


prop1.ci<-function(x,n, alpha){
  p.hat<- x/n
  b1<- p.hat-qnorm(1-alpha/2)*sqrt(p.hat*(1-p.hat)/n)
  b2<- p.hat+qnorm(1-alpha/2)*sqrt(p.hat*(1-p.hat)/n)
  c(b1,b2)
}
prop1.ci(x=32,n=58,alpha=0.05)
