# Генерирайте данни (xi,yi) i = 1...100, като xi са случайни числа от нормално разпределение 𝒩( mu= 5, sigma^2 = 1) и
# а) yi =2xi;
# б) yi =2xi + Epsi, където i са случайни числа от 𝒩( mu= 0, sigma^2 =1);
# в) yi =2xi + Epsi, където i са случайни числа от 𝒩( mu= 0, sigma^2 =4);
# г) yi =0.1xi + Epsi, където i са случайни числа от 𝒩( mu= 0, sigma^2 =1/4);
# д) yi са случайни числа от 𝒩( mu= 5, sigma^ 2 =1);
# е) yi =−2xi + Epsi, където i са случайни числа от 𝒩( mu= 0, sigma^2 =1).
# За всеки от случаите представете данните графично и намерете корелацията.


#a
n<-100
x<-rnorm(n,5,1)
y<-2*x
plot(x,y)
cor(x,y)

#b
eps<-rnorm(n,0,1)
y<-2*x+eps
plot(x,y)
cor(x,y)

#c
x <- rnorm(n, 5, 1)
eps <- rnorm(n, 0, 2)
y <- 2*x + eps
plot(x,y)
cor(x,y)

#d
x <- rnorm(n, 5, 1)
eps <- rnorm(n, 0, 0.5)
y <- 0.1*x + eps
plot(x,y, ylim=c(-4,4))
cor(x,y)

#e
x <- rnorm(n, 5, 1)
y <- rnorm(n, 5, 1)
plot(x,y)
cor(x,y)

#f
x <- rnorm(n, 5, 1)
eps <- rnorm(n, 0, 1)
y <- (-2)*x + eps
plot(x,y)
cor(x,y)
