# Количеството кашкавал, което се изразходва в дадена пицария за една седмица,
# е нормално разпределено със средно 41 кг и стандартно отклонение 5 кг. Каква е
# вероятността в произволно избрана седмица пицарията да изразходи над 51 кг кашкавал?
# Каква е вероятността в произволно избрана седмица пицарията да изразходи между 45 и
# 50 кг кашкавал? Колко кашкавал трябва да има в запас в дадена седмица, така че да е
# достатъчно с вероятност 0.99?


1-pnorm(51,41,5)

pnorm(50,41,5)-pnorm(45,41,5)

qnorm(0.99,41,5)
