# Честотите на срещане на буквите в английския език са следните (в %):
#  E     T    A    O    I    N    S    R    H    D    other
# 12.02 9.10 8.12 7.68 7.31 6.95 6.28 6.02 5.92 4.32 26.28
# В текст, състоящ се от 2004 букви, броят срещания на съответните букви е:
#  E     T    A    O    I    N    S    R    H    D    other
# 221   152  183  111  113  152  103  197  38   104    629
* Може ли да се твърди, че текстът е на английски?

# H0: (p_E, p_T, ...) = (0.1202, 0.0910, ...)
# H1: (p_E, p_T, ...) != (0.1202, 0.0910, ...)

load("letterFreq.RData")
probs*100
x1

chisq.test(x1,p=probs)
# p.value < 0.05 => H1.
